; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v7 ?v13)
             (pred_11 ?v8 ?v2)
             (pred_2 ?v7 ?v2)
             (pred_4 ?v12 ?v7 )
	     (pred_10 ?v7)
             (pred_1 ?v6)
             (pred_6 ?v8)
             (pred_5 ?v2)
             (pred_7 ?v7)
             (pred_3 ?v8)
             (pred_12 ?v7)
             (pred_9 ))



(:action op_1
:parameters (?v5 ?v11 ?v9 ?v10)
:precondition (and (pred_1 ?v5) (pred_1 ?v11) (pred_6 ?v9) (pred_5 ?v10)
          (pred_8 ?v5 ?v11) (pred_11 ?v9 ?v10)
                   (pred_2 ?v11 ?v10) (pred_10 ?v5) 
                   (pred_7 ?v11) (pred_3 ?v9))
:effect (and  (pred_12 ?v11) (not (pred_7 ?v11))))


(:action op_5
:parameters (?v5 ?v4)
:precondition (and (pred_1 ?v5) (pred_1 ?v4)
               (pred_10 ?v5) (pred_8 ?v5 ?v4) (pred_12 ?v4))
:effect (and (pred_10 ?v4) (not (pred_10 ?v5))))

(:action op_3
:parameters (?v5 ?v9)
:precondition (and (pred_1 ?v5) (pred_6 ?v9) 
                  (pred_10 ?v5) (pred_4 ?v9 ?v5) (pred_9 ))
:effect (and (pred_3 ?v9)
   (not (pred_4 ?v9 ?v5)) (not (pred_9 ))))


(:action op_2
:parameters (?v5 ?v1 ?v3)
:precondition (and (pred_1 ?v5) (pred_6 ?v1) (pred_6 ?v3)
                  (pred_10 ?v5) (pred_3 ?v3) (pred_4 ?v1 ?v5))
:effect (and (pred_3 ?v1) (pred_4 ?v3 ?v5)
        (not (pred_3 ?v3)) (not (pred_4 ?v1 ?v5))))

(:action op_4
:parameters (?v5 ?v9)
:precondition (and (pred_1 ?v5) (pred_6 ?v9) 
                  (pred_10 ?v5) (pred_3 ?v9))
:effect (and (pred_9 ) (pred_4 ?v9 ?v5) (not (pred_3 ?v9)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_17 obj_07 obj_03 obj_09 obj_14 obj_27 obj_12 obj_20 obj_29 obj_06 obj_11 obj_30 obj_25 obj_21 obj_04 obj_02 obj_26 obj_22 obj_24 obj_31 obj_28 obj_15 obj_05 obj_10
    obj_13 obj_19 obj_01
    obj_18 obj_08 obj_23
    )

    (:init
       (pred_9)

       (pred_1 obj_16)
       (pred_1 obj_17)
       (pred_1 obj_07)
       (pred_1 obj_03)
       (pred_1 obj_09)
       (pred_1 obj_14)
       (pred_1 obj_27)
       (pred_1 obj_12)
       (pred_1 obj_20)
       (pred_1 obj_29)
       (pred_1 obj_06)
       (pred_1 obj_11)
       (pred_1 obj_30)
       (pred_1 obj_25)
       (pred_1 obj_21)
       (pred_1 obj_04)
       (pred_1 obj_02)
       (pred_1 obj_26)
       (pred_1 obj_22)
       (pred_1 obj_24)
       (pred_1 obj_31)
       (pred_1 obj_28)
       (pred_1 obj_15)
       (pred_1 obj_05)
       (pred_1 obj_10)
       (pred_5 obj_13)
       (pred_5 obj_19)
       (pred_5 obj_01)
       (pred_6 obj_18)
       (pred_6 obj_08)
       (pred_6 obj_23)

       (pred_8 obj_16 obj_14)
       (pred_8 obj_16 obj_17)
       (pred_8 obj_17 obj_27)
       (pred_8 obj_17 obj_07)
       (pred_8 obj_17 obj_16)
       (pred_8 obj_07 obj_12)
       (pred_8 obj_07 obj_03)
       (pred_8 obj_07 obj_17)
       (pred_8 obj_03 obj_20)
       (pred_8 obj_03 obj_09)
       (pred_8 obj_03 obj_07)
       (pred_8 obj_09 obj_29)
       (pred_8 obj_09 obj_03)
       (pred_8 obj_14 obj_06)
       (pred_8 obj_14 obj_27)
       (pred_8 obj_14 obj_16)
       (pred_8 obj_27 obj_11)
       (pred_8 obj_27 obj_12)
       (pred_8 obj_27 obj_17)
       (pred_8 obj_27 obj_14)
       (pred_8 obj_12 obj_30)
       (pred_8 obj_12 obj_20)
       (pred_8 obj_12 obj_07)
       (pred_8 obj_12 obj_27)
       (pred_8 obj_20 obj_25)
       (pred_8 obj_20 obj_29)
       (pred_8 obj_20 obj_03)
       (pred_8 obj_20 obj_12)
       (pred_8 obj_29 obj_21)
       (pred_8 obj_29 obj_09)
       (pred_8 obj_29 obj_20)
       (pred_8 obj_06 obj_04)
       (pred_8 obj_06 obj_11)
       (pred_8 obj_06 obj_14)
       (pred_8 obj_11 obj_02)
       (pred_8 obj_11 obj_30)
       (pred_8 obj_11 obj_27)
       (pred_8 obj_11 obj_06)
       (pred_8 obj_30 obj_26)
       (pred_8 obj_30 obj_25)
       (pred_8 obj_30 obj_12)
       (pred_8 obj_30 obj_11)
       (pred_8 obj_25 obj_22)
       (pred_8 obj_25 obj_21)
       (pred_8 obj_25 obj_20)
       (pred_8 obj_25 obj_30)
       (pred_8 obj_21 obj_24)
       (pred_8 obj_21 obj_29)
       (pred_8 obj_21 obj_25)
       (pred_8 obj_04 obj_31)
       (pred_8 obj_04 obj_02)
       (pred_8 obj_04 obj_06)
       (pred_8 obj_02 obj_28)
       (pred_8 obj_02 obj_26)
       (pred_8 obj_02 obj_11)
       (pred_8 obj_02 obj_04)
       (pred_8 obj_26 obj_15)
       (pred_8 obj_26 obj_22)
       (pred_8 obj_26 obj_30)
       (pred_8 obj_26 obj_02)
       (pred_8 obj_22 obj_05)
       (pred_8 obj_22 obj_24)
       (pred_8 obj_22 obj_25)
       (pred_8 obj_22 obj_26)
       (pred_8 obj_24 obj_10)
       (pred_8 obj_24 obj_21)
       (pred_8 obj_24 obj_22)
       (pred_8 obj_31 obj_28)
       (pred_8 obj_31 obj_04)
       (pred_8 obj_28 obj_15)
       (pred_8 obj_28 obj_02)
       (pred_8 obj_28 obj_31)
       (pred_8 obj_15 obj_05)
       (pred_8 obj_15 obj_26)
       (pred_8 obj_15 obj_28)
       (pred_8 obj_05 obj_10)
       (pred_8 obj_05 obj_22)
       (pred_8 obj_05 obj_15)
       (pred_8 obj_10 obj_24)
       (pred_8 obj_10 obj_05)
       (pred_7 obj_20)
       (pred_7 obj_17)
       (pred_7 obj_15)
       (pred_2  obj_20 obj_13)
       (pred_2  obj_17 obj_19)
       (pred_2  obj_15 obj_01)
       (pred_12 obj_16)
       (pred_12 obj_07)
       (pred_12 obj_03)
       (pred_12 obj_09)
       (pred_12 obj_14)
       (pred_12 obj_27)
       (pred_12 obj_12)
       (pred_12 obj_29)
       (pred_12 obj_06)
       (pred_12 obj_11)
       (pred_12 obj_30)
       (pred_12 obj_25)
       (pred_12 obj_21)
       (pred_12 obj_04)
       (pred_12 obj_02)
       (pred_12 obj_26)
       (pred_12 obj_22)
       (pred_12 obj_24)
       (pred_12 obj_31)
       (pred_12 obj_28)
       (pred_12 obj_05)
       (pred_12 obj_10)

       (pred_11  obj_18 obj_13)
       (pred_11  obj_08 obj_19)
       (pred_11  obj_23 obj_01)
       (pred_4 obj_18 obj_12)
       (pred_4 obj_08 obj_29)
       (pred_4 obj_23 obj_05)
       (pred_10 obj_11)
    )

    (:goal (and
       (pred_4 obj_08 obj_28)
       (pred_4 obj_23 obj_15)
    ))
(:constraints
  (always (not (pred_10 obj_30)))
)
)

; plan
1. (op_5 obj_11 obj_02)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_02)
   goals met: 0 of 2
2. (op_5 obj_02 obj_26)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_26)
   goals met: 0 of 2
3. (op_5 obj_26 obj_22)
   deleted: (pred_10 obj_26)
   added: (pred_10 obj_22)
   goals met: 0 of 2
4. (op_5 obj_22 obj_05)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_05)
   goals met: 0 of 2
5. (op_3 obj_05 obj_23)
   deleted: (pred_4 obj_23 obj_05) (pred_9)
   added: (pred_3 obj_23)
   goals met: 0 of 2
6. (op_1 obj_05 obj_15 obj_23 obj_01)
   deleted: (pred_7 obj_15)
   added: (pred_12 obj_15)
   goals met: 0 of 2
7. (op_5 obj_05 obj_10)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_10)
   goals met: 0 of 2
8. (op_5 obj_10 obj_24)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_24)
   goals met: 0 of 2
9. (op_5 obj_24 obj_21)
   deleted: (pred_10 obj_24)
   added: (pred_10 obj_21)
   goals met: 0 of 2
10. (op_4 obj_21 obj_23)
   deleted: (pred_3 obj_23)
   added: (pred_9) (pred_4 obj_23 obj_21)
   goals met: 0 of 2
11. (op_5 obj_21 obj_29)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_29)
   goals met: 0 of 2
12. (op_3 obj_29 obj_08)
   deleted: (pred_4 obj_08 obj_29) (pred_9)
   added: (pred_3 obj_08)
   goals met: 0 of 2
13. (op_5 obj_29 obj_21)
   deleted: (pred_10 obj_29)
   added: (pred_10 obj_21)
   goals met: 0 of 2
14. (op_5 obj_21 obj_25)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_25)
   goals met: 0 of 2
15. (op_4 obj_25 obj_08)
   deleted: (pred_3 obj_08)
   added: (pred_9) (pred_4 obj_08 obj_25)
   goals met: 0 of 2
16. (op_5 obj_25 obj_21)
   deleted: (pred_10 obj_25)
   added: (pred_10 obj_21)
   goals met: 0 of 2
17. (op_3 obj_21 obj_23)
   deleted: (pred_4 obj_23 obj_21) (pred_9)
   added: (pred_3 obj_23)
   goals met: 0 of 2
18. (op_5 obj_21 obj_25)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_25)
   goals met: 0 of 2
19. (op_5 obj_25 obj_22)
   deleted: (pred_10 obj_25)
   added: (pred_10 obj_22)
   goals met: 0 of 2
20. (op_5 obj_22 obj_05)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_05)
   goals met: 0 of 2
21. (op_5 obj_05 obj_15)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_15)
   goals met: 0 of 2
22. (op_4 obj_15 obj_23)
   deleted: (pred_3 obj_23)
   added: (pred_9) (pred_4 obj_23 obj_15)
   goals met: 1 of 2
23. (op_5 obj_15 obj_26)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_26)
   goals met: 1 of 2
24. (op_5 obj_26 obj_22)
   deleted: (pred_10 obj_26)
   added: (pred_10 obj_22)
   goals met: 1 of 2
25. (op_5 obj_22 obj_25)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_25)
   goals met: 1 of 2
26. (op_3 obj_25 obj_08)
   deleted: (pred_4 obj_08 obj_25) (pred_9)
   added: (pred_3 obj_08)
   goals met: 1 of 2
27. (op_5 obj_25 obj_22)
   deleted: (pred_10 obj_25)
   added: (pred_10 obj_22)
   goals met: 1 of 2
28. (op_5 obj_22 obj_26)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_26)
   goals met: 1 of 2
29. (op_5 obj_26 obj_02)
   deleted: (pred_10 obj_26)
   added: (pred_10 obj_02)
   goals met: 1 of 2
30. (op_5 obj_02 obj_28)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_28)
   goals met: 1 of 2
31. (op_4 obj_28 obj_08)
   deleted: (pred_3 obj_08)
   added: (pred_9) (pred_4 obj_08 obj_28)
   goals met: 2 of 2
